products backend/app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def auto_login
     @token = params[:token]
    user = User.find(JWT.decode(@token, "mochi", true, algorithm: 'HS256')[0]["user_id"])