products backend/app/controllers/carts_controller.rb

SELECT "items".* FROM "items"
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 1]]
---
    def index
        cart_items = CartItem.all

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        cart = Cart.find(params[:id])