products backend/app/controllers/users_controller.rb

    def index
      users = User.all
      render json: User.all.to_json({include: [:carts => {:include => [:cart_items => {:include => [:item]}]}], except: [:created_at, :updated_at]})
---
SELECT "users".* FROM "users"
SELECT "cart_items".* FROM "cart_items" INNER JOIN "carts" ON "cart_items"."cart_id" = "carts"."id" WHERE "carts"."user_id" = $1  [["user_id", 3]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", 2]]
SELECT "items".* FROM "items"

    def create
      user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "username", "email", "phone_number", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def edit
      # byebug
      user = User.find(params[:id])
      user.update_attribute(:username, user_params[:username])
      user.update_attribute(:email, user_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", ""], ["updated_at", "2023-01-16 21:09:00.378551"], ["id", 3]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", ""], ["updated_at", "2023-01-16 21:09:00.412166"], ["id", 3]]